Autodesk.Revit.DB.Mechanical.MechanicalUtils.BreakCurve(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Breaks the duct curve into two parts at the given position.
Remarks:
This method is not applicable for breaking the flex duct.
document:
The document.
ductId:
The element id of the duct curve to break.
ptBreak:
The break point on the duct curve.
Returns:
The new duct curve element id if successful otherwise if a failure occurred an invalidElementId is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException:
"The element is neither a duct nor a duct placeholder."
-or-
"The given point is not on the duct curve."
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectAirTerminalOnDuct(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects an air terminal to a duct directly (without the need for a tee or takeoff).
Remarks:
The current location of the air terminal will be projected to the duct centerline, and if the point can be successfully projected,
the air terminal will be placed on the most suitable face of the duct.
document:
The document.
airTerminalId:
The air terminal id.
ductCurveId:
The duct curve id.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The familyinstance is not air terminal.
-or-
The element is not duct curve.
-or-
The air terminal already has physical connection.
-or-
The air terminal connector origin doesn't project within the center line of the duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects a group of placeholders that can intersect in a Cross connection.
Remarks:
The placeholders may or may not have physical connection. However:
The ends of four connectors should intersect at same point.The first and second placeholders should be collinear each other.The third and fourth placeholders should be collinear each other.The third and fourth should have intersection with first or second placeholder.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The end connector of the first placeholder.
connector2:
The end connector of the second placeholder.
connector3:
The end connector of the third placeholder.
connector4:
The end connector of the fourth placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not duct placeholder.
-or-
The owners of connectors belong to different types of system.
-or-
The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
-or-
The curves of connector3 and connector4 are not collinear or either the connecto1 or connector2 is not connector of curve end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects a trio of placeholders that can intersect in a Cross connection.
Remarks:
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The element id of the first duct placeholder.
placeholder2Id:
The element id of the second duct placeholder.
placeholder3Id:
The element id of third duct placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not duct placeholder.
-or-
The element id placeholder2Id is not duct placeholder.
-or-
The element id placeholder3Id is not duct placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder2Id does not connect on the curve placeholder1Id or vice versa.
-or-
The curve placeholder3Id does not connect on the curve placeholder1Id or vice versa.
-or-
The curve placeholder2Id and placeholder3Id are not collinear.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtCross(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects a pair of placeholders that can intersect in a Cross connection.
Remarks:
The placeholders must intersect each other. If connection succeeds, a new
placeholder duct is created. If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The element id of the first duct placeholder.
placeholder2Id:
The element id of the second duct placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not duct placeholder.
-or-
The element id placeholder2Id is not duct placeholder.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtTee(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects a trio of placeholders that can intersect in a Tee connection.
Remarks:
The three placeholders may or may not have physical connections. However,
the first connector should be collinear with the second connector, and the third connector must have
be able to be extended to have an intersection with first and second.
If first placeholder and second placeholder have the same size, the second one
is merged with first one and original placeholder element will become invalid.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The end connector of the first placeholder.
connector2:
The end connector of second placeholder.
connector3:
The end connector of the third placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not duct placeholder.
-or-
The owners of connectors belong to different types of system.
-or-
The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtTee(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects a pair of placeholders that can intersect in a Tee connection.
Remarks:
The placeholders must have a physical intersection.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The element Id of the first duct placeholder.
placeholder2Id:
The element Id of the second duct placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not duct placeholder.
-or-
The element id placeholder2Id is not duct placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder2Id does not connect on the curve placeholder1Id or vice versa.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtElbow(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Connects a pair of placeholders that can intersect in an Elbow connection.
Remarks:
The placeholders may have a physical intersection but this is not required.
If they are not intersecting the connectors must be coplanar and able to be moved to
intersect each other.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
connector1:
The end connector of the first placeholder.
connector2:
The end connector of the second placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The owner of connector is not duct placeholder.
-or-
The owners of connectors belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConnectDuctPlaceholdersAtElbow(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Connects a pair of placeholders that can intersect in an Elbow connection.
Remarks:
The placeholders must meet at a physical end connection.
If connection fails, the placeholders cannot be physically connected.
document:
The document.
placeholder1Id:
The element id of the first duct placeholder.
placeholder2Id:
The element id of the second duct placeholder.
Returns:
True if connection succeeds, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id placeholder1Id is not duct placeholder.
-or-
The element id placeholder2Id is not duct placeholder.
-or-
The elements belong to different types of system.
-or-
The curve placeholder1Id and placeholder2Id are not physically connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils.ConvertDuctPlaceholders(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Converts a collection of duct placeholder elements into duct elements.
Remarks:
Once conversion succeeds, the duct placeholder elements are deleted.
The new duct and fitting elements are created and connections are established.
document:
The document.
placeholderIds:
A collection of element IDs of duct placeholders.
Returns:
A collection of element IDs of ducts and fittings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
The given element IDs (placeholderIds) are not duct placeholders.
-or-
The elements belong to different types of system.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Mechanical.MechanicalUtils
General utility methods in the Autodesk Revit MEP product.
Since:
2012